<?php
declare(strict_types=1);

const DS = DIRECTORY_SEPARATOR; // это слэш
const BP = __DIR__; // это путь в папку, в которой находится файл
const CODE_PATH = BP . DS . 'code'; // путь к папке code


spl_autoload_register(function($className) { // функция для инициализации классов
    //на вход получаем название класса вида \Namespace1\Namespace2\Class
    $className = ltrim($className, '\\'); // убираем первый в строке \
    //Начало шифра цезаря для имени класса (всё, после папки code)
    // Ссылка на таблицу ASCII - https://www.man7.org/linux/man-pages/man7/ascii.7.html
    for($i=0; $i<strlen($className); $i++)  { //цикл длину строки
        if ($className[$i] == '\\') { //поиск в строке \
            continue; //если нашел \ - пропускает, чтобы не кодировать его
        }
        $shift = 2; // шаг смещения для шифра цезаря
        $number = ord($className[$i]); // помещение в переменную кода ASCII символа из имени класса
        if (($number >= 65) && ($number <= 90)){ // проверка регистра буквы. Здесь заглавные (в ASCII диапазон заглавных букв от 65 до 90)
            $shift = $shift % 26; // если шаг большой, то уменьшаем его до приемлевого значения. в этом случае до кол-ва букв в алфавите
            if ($number + $shift > 90) { // проверка на выход шага из алфавита, чтобы не выводил символы вместо букв
                $number = $number - 26; // отправляемся по таблице ASCII на 26 символов назад, чтобы попасть в алфавит
            }
        }
        if (($number >= 97) && ($number <= 122)) { // проверка регистра буквы. Здесь строчные (в ASCII диапазон строчных букв от 97 до 122)
            $shift = $shift % 26; // если шаг большой, то уменьшаем его до приемлевого значения. в этом случае до кол-ва букв в алфавите
            if ($number + $shift > 122) { // проверка на выход шага из алфавита, чтобы не выводил символы вместо букв
                $number = $number - 26; // отправляемся по таблице ASCII на 26 символов назад, чтобы попасть в алфавит
            }
        }
        if (($number >= 48) && ($number <= 57)){ // проверка на наличие цифры в имени класса.(в ASCII диапазон чисел 0 - 9  от 65 до 90)
            $shift = $shift % 10; // если шаг большой, то уменьшаем его до приемлевого значения. в этом случае до кол-ва чисел
            if ($number + $shift > 57){ // проверка на выход шага из числового диапазона, чтобы не выводил любую хуиту вместо цифр
                $number = $number - 10; // отправляемся по таблице ASCII на 10 символов назад, чтобы попасть в нужный нам диапазон
            }
        }

        $number = $number + $shift; //делаем шаг который нам нужен
        $className[$i] = chr($number); // приравниваем к символу в имени класса строчное значение $number из строки выше
    }
    $className = str_replace('\\', DS, $className); // заменяем оставшиеся \ на /
    $className .= '.php'; // добавление расширения к файлу
    //тут это преобразуется в Namespace1/Namespace2/Class.php, этот файл должен быть в папке CODE_PATH
    require_once CODE_PATH . DS . $className; //инициализация класса
    // echo CODE_PATH . DS . $className .PHP_EOL; - вызов всего пути, чтобы глянуть изменение
});


// new \PiphPaph\Arms\Warrior322(); - создание экзепляра класса и вызов всего, что в нём есть